Revit 2026 API

# ParameterTypeIdTagLeaderType Property

---

"Leader Type"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId TagLeaderType { get; }
```
```vb
Public Shared ReadOnly Property TagLeaderType As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ TagLeaderType {
	ForgeTypeId^ get ();
}
```
```fsharp
static member TagLeaderType : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace